<?php
require_once "common.php";
?>
<html>
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <title>QingScan 安装step1</title>
    <link href="../../static/bootstrap-5.1.3/css/bootstrap.min.css" rel="stylesheet">
</head>
<body style="background-color: #eee;">
<div id="form"
     style="background-color:#fff;width: 900px;margin: 50 auto;border:1px dotted #eee;padding: 10px;border-radius: 10px;">
    <h2 style="text-align: center;">授权协议</h2>
    <div class="content" style="height:500px;border:1px dotted #ccc;padding:10px;overflow:auto;border-radius: 10px;">


        <p>版权所有 (c) <?php echo date('Y') ?>，QingScan系统保留所有权利。</p>

        <p>感谢您选择QingScan系统。希望我们的努力能为您提供一个高效快速、强大的网络安全解决方案。QingScan的网址为
            https://github.com/78778443/QingScan，产品官方讨论区网址为
            https://github.com/78778443/QingScan/issues</p>

        <p>
            用户须知：本协议是您与汤青松个人之间关于您使用汤青松个人提供的各种软件产品及服务的法律协议。无论您是个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，包括免除或者限制汤青松责任的免责条款及对您的权利限制。请您审阅并接受或不接受本服务条款。如您不同意本服务条款及/或汤青松随时对其的修改，您应不使用或主动取消汤青松个人提供的QingScan系统。否则，您的任何对QingScan系统中的相关服务的注册、登陆、下载、查看等使用行为将被视为您对本服务条款全部的完全接受，包括接受汤青松对服务条款随时所做的任何修改。
        <p>本服务条款一旦发生变更,
            汤青松将在网页上公布修改内容。修改后的服务条款一旦在网站管理后台上公布即有效代替原来的服务条款。您可随时登陆汤青松官方论坛查阅最新版服务条款。如果您选择接受本条款，即表示您同意接受协议各项条件的约束。如果您不同意本服务条款，则不能获得使用本服务的权利。您若有违反本条款规定，汤青松个人有权随时中止或终止您对QingScan系统的使用资格并保留追究相关法律责任的权利。</p>
        <p>
            在理解、同意、并遵守本协议的全部条款后，方可开始使用QingScan系统。您可能与汤青松个人直接签订另一书面协议，以补充或者取代本协议的全部或者任何部分。</p></p>

        <p>
            汤青松拥有本软件的全部知识产权。本软件只供许可协议，并非出售。汤青松只允许您在遵守本协议各项条款的情况下复制、下载、安装、使用或者以其他方式受益于本软件的功能或者知识产权。</p>
        <h3>一. 软件使用范围</h3>
        <ol>
            <li>本工具禁止进行未授权商业用途，禁止二次开发后进行未授权商业用途。</li>
            <li>
                本工具仅面向合法授权的企业安全建设行为，在使用本工具进行检测时，您应确保该行为符合当地的法律法规，并且已经取得了足够的授权。
            </li>
            <li>如您在使用本工具的过程中存在任何非法行为，您需自行承担相应后果，我们将不承担任何法律及连带责任。</li>
            <li>在使用本工具前，请您务必审慎阅读、充分理解各条款内容，限制、免责条款或者其他涉及您重大权益的条款可能会以加粗、加下划线等形式提示您重点注意。
                除非您已充分阅读、完全理解并接受本协议所有条款，否则，请您不要使用本工具。您的使用行为或者您以其他任何明示或者默示方式表示接受本协议的，即视为您已阅读并同意本协议的约束。
            </li>
        </ol>
        <h3>二. 协议许可的权利</h3>
        <ol>
            <li>您可以在完全遵守本许可协议的基础上，将本软件应用于非商业用途，而不必支付软件版权许可费用。</li>
            <li>您可以在协议规定的约束和限制范围内修改QingScan系统源代码(如果被提供的话)或界面风格以适应您的网站要求。
            </li>
            <li>
                您拥有使用本软件构建的网站中全部会员资料、文章及相关信息的所有权，并独立承担与使用本软件构建的网站内容的审核、注意义务，确保其不侵犯任何人的合法权益，独立承担因使用汤青松软件和服务带来的全部责任，若造成汤青松个人或用户损失的，您应予以全部赔偿。
            </li>
            <li>
                若您需将汤青松软件或服务用户商业用途，必须另行获得汤青松的书面许可，您在获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持期限、技术支持方式和技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。
            </li>
        </ol>

        <h3>三. 协议规定的约束和限制</h3>
        <ol>
            <li>
                未获汤青松个人书面商业授权之前，不得将本软件用于商业用途（包括但不限于企业网站、经营性网站、以营利为目或实现盈利的网站）。购买商业授权请登陆http://www.songboy.site参考相关说明，也可以添加微信:songboy8888了解详情。
            </li>
            <li>不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</li>
            <li>
                无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用QingScan系统的整体或任何部分，未经书面许可，页面页脚处的QingScan系统名称和汤青松个人下属网站（http://www.songboy.site）
                的链接都必须保留，而不能清除或修改。
            </li>
            <li>禁止在QingScan系统的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</li>
            <li>
                您从应用中心下载的应用程序，未经应用程序开发者/所有者的书面许可，不得对其进行反向工程、反向汇编、反向编译等，不得擅自复制、修改、链接、转载、汇编、发表、出版、发展与之有关的衍生产品、作品等。
            </li>
            <li>如果您未能遵守本协议的条款，您的授权将被终止，所许可的权利将被收回，同时您应承担相应法律责任。</li>
        </ol>

        <h3>四. 有限担保和免责声明</h3>
        <ol>
            <li>本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</li>
            <li>
                用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。
            </li>
            <li>汤青松个人不对使用本软件构建的网站中或者论坛中的文章或信息承担责任，全部责任由您自行承担。</li>
            <li>
                汤青松个人对汤青松提供的软件和服务之及时性、安全性、准确性不作担保，由于不可抗力因素、汤青松个人无法控制的因素（包括黑客攻击、停断电等）等造成软件使用和服务中止或终止，而给您造成损失的，您同意放弃追究汤青松个人责任的全部权利。
                6.汤青松个人特别提请您注意，汤青松个人为了保障公司业务发展和调整的自主权，汤青松个人拥有随时经或未经事先通知而修改服务内容、中止或终止部分或全部软件使用和服务的权利，修改会公布于汤青松个人网站相关页面上，一经公布视为通知。
                汤青松个人行使修改或中止、终止部分或全部软件使用和服务的权利而造成损失的，汤青松个人不需对您或任何第三方负责。
            </li>
        </ol>

        <p>
            有关QingScan系统最终用户授权协议、商业授权与技术服务的详细内容，均由汤青松个人独家提供。汤青松个人拥有在不事先通知的情况下，修改授权协议和服务价目表的权利，修改后的协议或价目表对自改变之日起的新授权用户生效。</p>
        <p>
            一旦您开始安装QingScan系统，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权利的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>
        <p>本许可协议条款的解释，效力及纠纷的解决，适用于中华人民共和国大陆法律。</p>

        <p>
            若您和汤青松之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交汤青松所在地北京市海淀区人民法院管辖。汤青松个人拥有对以上各项条款内容的解释权及修改权。</p>

        <p>（正文完）</p>

        <p align="right">汤青松个人</p>
    </div>
    <br>
    <?php
    $bo = false;

    if (is_writable('../../config/database.php')) {
        echo "<font color='green'>code/app/config/database.php文件可写</font>";
        $bo = true;
    } else {
        echo "<font color='red'>code/config/database.php文件不可写</font>";
    }

    echo "<br  ><br  >";

    if ($bo) {
        echo '<a class="btn btn-outline-info" href="step2.php" >我同意此协议</a>';
    } else {
        echo "<input type='button' value='我同意此协议' disabled />";
    }
    ?>
</div>
</body>
</html>
